package javabeans;

public enum ItemUnit {
	ЯЩИК("ящик", "ящика", "ящиков"), //
	ШТУКА("штука", "штуки", "штук", "шт"), //
	КАМЕНЬ("камень", "камня", "камней"), //
	КРИСТАЛЛ("кристалл", "кристалла", "кристаллов"), //
	ШКАТУЛКА("шкатулка", "шкатулки", "шкатулок"), //
	КОРОБОК("коробок", "коробка", "коробков"), //
	ЛАРЕЦ("ларец", "ларца", "ларцов"), //
	КУСОК("кусок", "куска", "кусков"), //
	ПРОБИРКА("пробирка", "пробирки", "пробирок"), //
	РЕТОРТА("реторта", "реторты", "реторт"), //
	КОЛБА("колба", "колбы", "колб"), //
	БАНКА("банка", "банки", "банок"), //
	КАТУШКА("катушка", "катушки", "катушек"), //
	ГРИБ("гриб", "гриба", "грибов"), //
	МИЛЛИЛИТР("мл"), //
	;

	private final String[] unitStr;

	private ItemUnit(final String... unitStr) {
		this.unitStr = unitStr;
	}

	public boolean equals(final String str) {
		for (final String unit : unitStr) {
			if (str.endsWith(unit)) {
				return true;
			}
		}
		return false;
	}
}