package javabeans.elmo;

import java.util.Arrays;
import java.util.List;

import org.openrdf.elmo.annotations.rdf;

public enum ItemUnit {
	ЯЩИК("ящик", "ящика", "ящиков"), //
	ШТУКА("штука", "штуки", "штук", "шт", "шт."), //
	КАМЕНЬ("камень", "камня", "камней"), //
	КРИСТАЛЛ("кристалл", "кристалла", "кристаллов"), //
	ШКАТУЛКА("шкатулка", "шкатулки", "шкатулок"), //
	КОРОБОК("коробок", "коробка", "коробков"), //
	ЛАРЕЦ("ларец", "ларца", "ларцов"), //
	КУСОК("кусок", "куска", "кусков"), //
	ПРОБИРКА("пробирка", "пробирки", "пробирок"), //
	РЕТОРТА("реторта", "реторты", "реторт"), //
	КОТЕЛОК("котелок", "котелка", "котелков"), //
	КОЛБА("колба", "колбы", "колб"), //
	БАНКА("банка", "банки", "банок"), //
	КАТУШКА("катушка", "катушки", "катушек"), //
	ГРИБ("гриб", "гриба", "грибов"), //
	ЦВЕТОК("цветок", "цветка", "цветков"), //
	ВЕТКА("ветка", "ветки", "веток"), //
	ПОБЕГ("побег", "побега", "побегов"), //
	ПУЧОК("пучок", "пучка", "пучков"), //
	КОЛОСОК("колосок", "колоска", "колосков"), //
	МИЛЛИЛИТР("мл"), //
	;

	private final List<String> unitStr;

	private ItemUnit(final String... unitStr) {
		this.unitStr = Arrays.asList(unitStr);
	}

	public boolean equals(final String str) {
		for (final String unit : unitStr) {
			if (str.endsWith(unit)) {
				return true;
			}
		}
		return false;
	}
}